fix flowchart not rendering error
